const tamilConstants = (code) => {

  switch (code) {

    case 'letter':
    return{
      uyir: "அ,ஆ,இ,ஈ,உ,ஊ,எ,ஏ,ஐ,ஒ,ஓ,ஓள",
      mei: "க்,ங்,ச்,ஞ்,ட்,ண்,த்,ந்,ப்,ம்,ய்,ர்,ல்,வ்,ழ்,ள்,ற்,ன்",
      lagaram: "ல்,ள்,ழ்;ல,ள,ழ;லா,ளா,ழா;லி,ளி,ழி;லீ,ளீ,ழீ;லு,ளு,ழு;லூ,ளூ,ழூ;லெ,ளெ,ழெ;லே,ளே,ழே;லை,ளை,ழை;",
      nagaram: "ன்,ண்,ந்;ன,ண,ந;னா,ணா,நா;னி,ணி,நி;னீ,ணீ,நீ;னு,ணு,நு;னூ,ணூ,நூ;னெ,ணெ,நெ;னை,ணை,நை;னே,ணே,நே;",
      ragaram: "ர்,ற்;ர,ற;ரி,றி;ரீ,றீ;ரு,று;ரூ,றூ;ரெ,றெ;றெ,றே;ரை,றை;ரொ,றொ;ரோ,றோ;",
    }

    break;

  }

}

export default tamilConstants
